Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: A clearance of 60 inches (1525 mm) minimum in length adjacent to the 60-inch (1525 mm) width of the open face of the shower compartment, and 30 inches (760 mm) minimum in depth, shall be provided.
fr_ca: Il faut prévoir un dégagement d'au moins 60 po [1525 mm] en longueur adjacent à la largeur de 60 po [1525 mm] de la face ouverte du compartiment de douche, et d'au moins 30 po [760 mm] en profondeur.

source: A coat hook in close proximity to the changing surface.
fr_ca: Un porte-manteau à proximité de la surface à langer.

source: A coat hook located in close proximity to the changing surface.
fr_ca: Un porte-manteau situé à proximité de la surface à langer.

source: A combination of interior exit stairways, interior exit ramps and exit passageways, constructed in accordance with Sections 1023.2, 1023.3.1 and 1024, respectively, and forming a continuous protected enclosure, shall be permitted to extend an interior exit stairway or ramp to the exit discharge or a public way.
fr_ca: Une combinaison d’escaliers d’issue intérieurs, de rampes d’issue intérieures et de passages d’issue, construits conformément aux sections 1023.2, 1023.3.1 et 1024, respectivement, et formant un encloisonnement protégé continu, peut être utilisée pour prolonger un escalier ou une rampe d’issue intérieurs jusqu’au niveau d’évacuation menant à l’extérieur ou à une voie publique.

source: A companion seat, complying with Section 802.7, shall be provided beside each wheelchair space.
fr_ca: Un siège d'accompagnateur, conforme à la section 802.7, doit être prévu à côté de chaque espace pour fauteuil roulant.

source: A contrasting marking stripe shall be provided on each tread at the nosing or leading edge such that the location of each tread is readily apparent when viewed in descent.
fr_ca: Une bande de marquage contrastante doit être prévue sur chaque giron, au niveau du nez de marche ou du bord avant, de manière que l’emplacement de chaque giron soit facilement perceptible lorsqu’il est observé dans le sens de la descente.

source: A counter that is adjustable to provide a work surface at variable heights 29 inches (735 mm) minimum and 36 inches (915 mm) maximum above the floor, or that can be relocated within that range without cutting the counter or damaging adjacent cabinets, walls, doors, and structural elements, shall be permitted.
fr_ca: Un comptoir réglable pour fournir une surface de travail à des hauteurs variables comprises entre 29 po [735 mm] et 36 po [915 mm] au-dessus du sol, ou qui peut être déplacé dans cette plage sans couper le comptoir ou endommager les armoires, les murs, les portes et les éléments de structure adjacents, est autorisé.

source: A curb complying with Section 405.9.2.1 or a barrier complying with Section 405.9.2.2 shall be provided.
fr_ca: Il faut prévoir une bordure conforme à la section 405.9.2.1 ou une barrière conforme à la section 405.9.2.2.

source: A curb shall be a minimum of 4 inches (100 mm) in height.
fr_ca: Une bordure doit avoir une hauteur minimale de 4 po [100 mm].

source: A curb shall be not less than 4 inches (102 mm) in height.
fr_ca: Une bordure ne doit pas avoir une hauteur inférieure à 4 po (102 mm).

source: A curb, rail, wall or barrier shall be provided to serve as edge protection.
fr_ca: Une bordure, une rampe, un mur ou une barrière doit être prévu pour servir de protection des bords.

source: A description of that portion of the structure for which the certificate is issued.
fr_ca: Une description de la partie de la structure pour laquelle le certificat est délivré.

source: A difference in elevation between the minimum required floor elevation at the primary entrances and vehicular and pedestrian arrival points within 50 feet (15 240 mm) exceeding 30 inches (762 mm).
fr_ca: Une différence d’élévation de plus de 30 po (762 mm) entre l’élévation minimale requise du plancher aux entrées principales et les points d’arrivée des véhicules et des piétons situés à moins de 50 pi (15 240 mm).

source: A dispenser for soap complying with Section 308.
fr_ca: Un distributeur de savon conforme à la section 308.

source: A distinctive marking stripe shall be provided at each nosing or leading edge adjacent to the transition.
fr_ca: Une bande de marquage distinctive doit être prévue à chaque nez de marche ou bord avant adjacent à la transition.

source: A door or panel shall be permitted to close the opening.
fr_ca: Une porte ou un panneau peut fermer l'ouverture.

source: A drainage system for area wells is not required where the foundation is on well-drained soil or sand-gravel mixture soils in accordance with the United Soil Classification System, Group I Soils, in accordance with Section 1803.5.1.
fr_ca: Un système de drainage des puits de fenêtre n’est pas exigé lorsque les fondations reposent sur un sol bien drainé ou sur un sol constitué d’un mélange de sable et de gravier conforme au système unifié de classification des sols, groupe I, conformément à la section 1803.5.1.

source: A fascia or railing system complying with the guard requirements of Section 1015 shall be provided for the full width of the aisle where the foot of the aisle is more than 30 inches (762 mm) above the floor or grade below.
fr_ca: Un système de plinthe ou de garde-corps conforme aux exigences relatives aux garde-corps de la section 1015 doit être prévu sur toute la largeur de l’allée lorsque le pied de l’allée est situé à plus de 30 po (762 mm) au-dessus du plancher ou du sol situé en contrebas.

source: A fire alarm system shall be provided in accordance with Section 907.2.13.
fr_ca: Un système d'alarme d'incendie doit être prévu selon la section 907.2.13.

source: A fire alarm system shall be provided in accordance with Section 907.2.14.
fr_ca: Un système d'alarme d'incendie doit être prévu selon la section 907.2.14.

source: A fire barrier is not required between the atrium and the adjoining spaces of up to three floors of the atrium provided that such spaces are accounted for in the design of the smoke control system.
fr_ca: Une barrière coupe-feu n’est pas requise entre l’atrium et les espaces adjacents pouvant s’étendre sur au plus trois étages de l’atrium, à condition que ces espaces soient pris en compte dans la conception du système de contrôle de la fumée.

source: A fire barrier is not required between the atrium and the adjoining spaces where the atrium is not required to be provided with a smoke control system.
fr_ca: Une barrière coupe-feu n’est pas requise entre l’atrium et les espaces adjacents lorsque l’atrium n’est pas tenu d’être équipé d’un système de contrôle de la fumée.

source: A fire barrier is not required where a glass wall forming a smoke partition is provided.
fr_ca: Une barrière coupe-feu n'est pas exigée lorsqu'un mur de verre formant une cloison pare-fumée est prévu.

source: A fire barrier is not required where a glass-block wall assembly complying with Section 2110 and having a 3/4-hour fire protection rating is provided.
fr_ca: Une barrière coupe-feu n’est pas requise lorsqu’un ensemble de mur en blocs de verre conforme à l’article 2110 et ayant un degré de protection contre l’incendie de 3/4 heure est prévu.

source: A fire command center complying with Section 911 shall be provided in a location approved by the fire code official.
fr_ca: Un centre de commandement en cas d’incendie conforme à l’article 911 doit être aménagé à un emplacement approuvé par le responsable de la réglementation en matière de prévention des incendies.

source: A fire door assembly complying with Section 716 shall be installed in the fire barrier to provide a means of egress from the interior exit stairway and ramp to the exit passageway.
fr_ca: Une porte coupe-feu conforme à la section 716 doit être installée dans la barrière coupe-feu pour procurer un moyen d'évacuation de l'escalier et de la rampe d'issue intérieurs vers le passage d'issue.

source: A fire-resistant pipe-protection system that has been tested in accordance with UL 1489.
fr_ca: Un système de protection des tuyaux contre le feu ayant fait l’objet d’un essai conformément à la norme UL 1489.

source: A flight of stairs shall not have a vertical rise larger than 151 inches (3835 mm) between floor levels or landings.
fr_ca: L'élévation verticale d'une volée de marches ne doit pas être supérieure à 151 pouces (3 835 mm) entre les niveaux du sol ou les paliers.

source: A floor or landing is not required at the top of an interior flight of stairs, including stairs in an enclosed garage, provided that a door does not swing over the stairs.
fr_ca: Un plancher ou un palier n'est pas exigé au sommet d'une volée de marches intérieure, y compris les escaliers dans un garage fermé, à condition qu'une porte ne s'ouvre pas au-dessus de l'escalier.

source: A folding or non-folding seat complying with Section 610 shall be provided on the wall opposite the control wall.
fr_ca: Un siège pliant ou non pliant conforme à la section 610 doit être prévu sur le mur opposé au mur de commande.

source: A folding seat complying with Section 610 shall be provided on an end wall.
fr_ca: Un siège pliant conforme à la section 610 doit être prévu sur un mur d'extrémité.

source: A folding seat complying with Section 610 shall be provided on the seat wall opposite the back wall.
fr_ca: Un siège pliant conforme à la section 610 doit être prévu sur le mur du siège opposé au mur arrière.

source: A forward or parallel approach shall be provided for a front loading machine.
fr_ca: Un accès frontal ou parallèle doit être prévu pour une machine à chargement frontal.

source: A gas detection alarm shall be initiated where any sensor detects a concentration of gas exceeding the following thresholds:
fr_ca: Une alarme de détection de gaz doit être déclenchée lorsqu'un capteur détecte une concentration de gaz dépassant les seuils suivants :

source: A hand shower with a hose 59 inches (1500 mm) minimum in length, that can be used as both a fixed shower head and as a hand shower, shall be provided.
fr_ca: Il faut prévoir une douchette à main avec un tuyau d'une longueur minimale de 59 po [1500 mm], qui peut être utilisée à la fois comme pomme de douche fixe et comme douchette à main.

source: A hand towel dispenser or hand dryer complying with Table 603.6.
fr_ca: Un distributeur de serviettes ou un sèche-mains conforme au Tableau 603.6.

source: A hard-wired electric doorbell shall be provided.
fr_ca: Une sonnette électrique câblée doit être installée.

source: A high-rise building shall be equipped with a standpipe system as required by Section 905.3.
fr_ca: Un bâtiment de grande hauteur doit être équipé d’un système de canalisations d’incendie conformément aux exigences de l’article 905.3.

source: A horizontal assembly is not required between the atrium and openings for escalators complying with Section 712.1.3.
fr_ca: Un ensemble horizontal n’est pas exigé entre l’atrium et les ouvertures pour les escaliers mécaniques conformes à l’article 712.1.3.

source: A horizontal assembly is not required between the atrium and openings for exit access stairways and ramps complying with Item 4 of Section 1019.3.
fr_ca: Un ensemble horizontal n’est pas exigé entre l’atrium et les ouvertures pour les escaliers et les rampes d’accès à l’issue conformes au point 4 de l’article 1019.3.

source: A horizontal grab bar 12 inches (305 mm) minimum in length shall be provided on the head end wall at the front edge of the bathtub.
fr_ca: Une barre d'appui horizontale d'une longueur minimale de 12 po [305 mm] doit être prévue sur la tête de mur, au bord avant de la baignoire.

source: A horizontal grab bar 24 inches (610 mm) minimum in length shall be provided on the control end wall beginning near the front edge of the bathtub and extending toward the inside corner of the bathtub.
fr_ca: Il faut prévoir une barre d'appui horizontale d'une longueur minimale de 24 po [610 mm] sur le mur de l'extrémité de commande, commençant près du bord avant de la baignoire et se prolongeant vers le coin intérieur de la baignoire.

source: A label meeting the requirements of this section shall be permitted in lieu of the manufacturer’s designation.
fr_ca: Une étiquette conforme aux exigences de la présente section peut être utilisée à la place de la désignation du fabricant.

source: A label shall be permitted in lieu of the manufacturer’s designation.
fr_ca: Une étiquette est autorisée en lieu et place de la désignation du fabricant.

source: A lavatory complying with Section 1104.11.3.1.1 shall be permitted at one end of the bathtub if a clearance 48 inches (1220 mm) minimum in length and 30 inches (760 mm) minimum in width is provided in front of the bathtub.
fr_ca: Un lavabo conforme à la section 1104.11.3.1.1 doit être autorisé à une extrémité de la baignoire si un dégagement d'au moins 48 po [1220 mm] en longueur et d'au moins 30 po [760 mm] en largeur est prévu devant la baignoire.

source: A lavatory complying with Section 606 or an alcohol-based hand sanitizer dispenser.
fr_ca: Un lavabo conforme à la section 606 ou un distributeur de désinfectant pour les mains à base d'alcool.

source: A lavatory complying with Section 606 shall be permitted at the end of the clearance opposite the seat.
fr_ca: Un lavabo conforme à l'article 606 doit être autorisé à l'extrémité de l'espace libre opposé au siège.

source: A lavatory complying with Section 606.
fr_ca: Un lavabo conforme à la section 606.

source: A lavatory complying with Sections 606.3, 606.4 and 1104.1.1 shall be permitted.
fr_ca: Un lavabo conforme aux articles 606.3, 606.4 et 1104.1.1 peut être autorisé.

source: A lavatory measuring 24 inches (610 mm) maximum in depth and complying with Section 1103.11.2.2 shall be permitted on the rear wall 18 inches (455 mm) minimum from the centerline of the water closet to the side edge of the lavatory where the clearance at the water closet is 66 inches (1675 mm) minimum measured perpendicular from the rear wall.
fr_ca: Un lavabo d'une profondeur maximale de 24 po [610 mm] et conforme à l'article 1103.11.2.2 peut être installé sur le mur arrière à une distance minimale de 18 po [455 mm] entre la ligne d'axe de la cabine de toilette et le bord latéral du lavabo, lorsque le dégagement au niveau de la cabine de toilette est d'au moins 66 po [1675 mm], mesuré perpendiculairement au mur arrière.

source: A life safety evaluation, complying with NFPA 101, shall be done for a facility utilizing the reduced width requirements of Table 1030.6.2 for smoke-protected assembly seating.
fr_ca: Une évaluation de la sécurité des personnes, conforme à la norme NFPA 101, doit être effectuée pour tout établissement utilisant les exigences de largeur réduite du tableau 1030.6.2 pour les sièges pour assemblées protégés contre la fumée.

source: A manual fire alarm system shall not be required in Group E occupancies with an occupant load of 50 or less.
fr_ca: Un système d’alarme d’incendie manuel n’est pas requis dans les usages du groupe E dont la charge d’occupants est d’au plus 50 personnes.

source: A manual fire alarm system that activates the occupant notification system in accordance with Section 907.5 shall be installed in Group A occupancies where the occupant load due to the assembly occupancy is 300 or more, or where the Group A occupant load is more than 100 persons above or below the lowest level of exit discharge.
fr_ca: Un système d’alarme d’incendie manuel qui active le système de notification des occupants conformément à la section 907.5 doit être installé dans les usages du groupe A lorsque la charge d’occupants attribuable à l’usage d’assemblée est de 300 personnes ou plus, ou lorsque la charge d’occupants du groupe A est supérieure à 100 personnes au-dessus ou au-dessous du niveau de l’issue d’évacuation menant à l’extérieur le plus bas.

source: A manual fire alarm system that activates the occupant notification system in accordance with Section 907.5 shall be installed in Group F occupancies where both of the following conditions exist:
fr_ca: Un système d’alarme d’incendie manuel qui active le système de notification des occupants conformément à la section 907.5 doit être installé dans les usages du groupe F lorsque les deux conditions suivantes sont présentes :

source: A manual fire alarm system that activates the occupant notification system in accordance with Section 907.5 shall be installed in Group H-5 occupancies and in occupancies used for the manufacture of organic coatings.
fr_ca: Un système d’alarme d’incendie manuel qui active le système de notification des occupants conformément à la section 907.5 doit être installé dans les usages du groupe H-5 et dans les usages destinés à la fabrication de revêtements organiques.

source: A manual fire alarm system that activates the occupant notification system in accordance with Section 907.5 shall be installed in Group I occupancies.
fr_ca: Un système d’alarme d’incendie manuel qui active le système de notification des occupants conformément à la section 907.5 doit être installé dans les usages du groupe I.

source: A manual fire alarm system that initiates the occupant notification signal utilizing an emergency voice/alarm communication system meeting the requirements of Section 907.5.2.2 and installed in accordance with Section 907.6 shall be installed in Group E occupancies.
fr_ca: Un système d’alarme d’incendie manuel qui déclenche le signal de notification des occupants au moyen d’un système de communication vocale et d’alarme d’urgence conforme aux exigences de la section 907.5.2.2 et installé conformément à la section 907.6 doit être installé dans les usages du groupe E.

source: A manual fire alarm system, which activates the occupant notification system in accordance with Section 907.5, shall be installed in Group B occupancies where one of the following conditions exists:
fr_ca: Un système d’alarme d’incendie manuel, qui active le système de notification des occupants conformément à la section 907.5, doit être installé dans les usages du groupe B lorsque l’une des conditions suivantes est présente :

source: A means for visually identifying a visitor without opening the unit entry door shall be provided.
fr_ca: Un dispositif permettant d’identifier visuellement un visiteur sans ouvrir la porte d’entrée du logement doit être prévu.

source: A means of escape to a roof in place of a second means of egress is permitted.
fr_ca: Un moyen d’évacuation vers un toit peut être prévu à la place d’un deuxième moyen d’évacuation.

source: A means to hold the hand shower wand while in the on or off position shall be located at a height of 38 inches (965 mm) minimum and 48 inches (1220 mm) maximum above the shower finish floor..
fr_ca: Un moyen de tenir la douchette en position ouverte ou fermée doit être situé à une hauteur comprise entre 38 po [965 mm] et 48 po [1220 mm] au-dessus du sol fini de la douche.

source: A multistory dwelling unit or sleeping unit that is not provided with elevator service is not required to be a Type B unit.
fr_ca: Une unité d'habitation ou une unité de couchage à plusieurs étages qui n'est pas équipée d'un service d'ascenseur n'est pas tenue d'être une unité de type B.

source: A nosing projection is not required where the tread depth is not less than 11 inches (279 mm).
fr_ca: Une saillie de nez de marche n'est pas exigée lorsque la profondeur du giron est d'au moins 11 po [279 mm].

source: A nosing projection not less than 3/4 inch (19 mm) and not more than 11/4 inches (32 mm) shall be provided on stairways.
fr_ca: Une saillie du nez de marche d'au moins 3/4 po [19 mm] et d'au plus 11/4 po [32 mm] doit être prévue sur les escaliers.

source: A parallel approach shall be provided for a top loading machine.
fr_ca: Un accès parallèle doit être prévu pour une machine à chargement par le haut.

source: A permanent seat at the head end of the bathtub or a removable in-tub seat shall be provided.
fr_ca: Il faut prévoir un siège permanent à la tête de mur de la baignoire ou un siège amovible dans la baignoire.

source: A permit shall not be required for the installation, alteration or repair of generation, transmission, distribution or metering or other related equipment that is under the ownership and control of public service agencies by established right.
fr_ca: Aucun permis n’est exigé pour l’installation, la modification ou la réparation d’équipements de production, de transport, de distribution ou de comptage, ou d’autres équipements connexes, qui appartiennent aux organismes de services publics et sont sous leur contrôle en vertu d’un droit établi.

source: A permit shall not be valid until the fees prescribed by law have been paid, nor shall an amendment to a permit be released until the additional fee, if any, has been paid.
fr_ca: Un permis n’est valide qu’après le paiement des frais prescrits par la loi, et aucune modification à un permis ne doit être délivrée tant que les frais supplémentaires, le cas échéant, n’ont pas été payés.

source: A person shall not make connections from a utility, a source of energy, fuel, or power, or a water system or sewer system to any building or system that is regulated by this code for which a permit is required, until approved by the building official.
fr_ca: Une personne ne doit pas effectuer de raccordement à un service public, à une source d’énergie, de combustible ou de puissance, ou à un réseau d’eau ou d’égout, vers un bâtiment ou un système régi par le présent code pour lequel un permis est exigé, avant d’avoir obtenu l’approbation du responsable de la construction.

source: A portable fire extinguisher shall be provided.
fr_ca: Un extincteur portatif doit être prévu.

source: A raised star shall be provided on both jambs at the main entry level.
fr_ca: Il faut prévoir une étoile en relief sur les deux montants au niveau de l'entrée principale.

source: A receptacle outlet shall not be required for the servicing of evaporative coolers.
fr_ca: Une prise de courant n'est pas exigée pour l'entretien des refroidisseurs par évaporation.

source: A roof canopy in an outdoor stadium shall be permitted to be less than 15 feet (4572 mm) above the highest aisle or aisle accessway provided that there are no objects less than 80 inches (2032 mm) above the highest aisle or aisle accessway.
fr_ca: Un auvent de toit dans un stade extérieur peut être situé à moins de 15 pi (4 572 mm) au-dessus de l’allée ou de la voie d’accès à l’allée située au niveau le plus élevé, à condition qu’aucun objet ne soit situé à moins de 80 po (2 032 mm) au-dessus de l’allée ou de la voie d’accès à l’allée située au niveau le plus élevé.

source: A roof level or portion thereof shall be permitted to be used as an occupied roof provided the occupancy of the roof is an occupancy that is permitted by Table 504.4 for the story immediately below the roof.
fr_ca: Un niveau de toit ou une partie de celui-ci peut être utilisé comme toit occupé, à condition que l’usage du toit soit un usage autorisé par le tableau 504.4 pour l’étage situé immédiatement sous le toit.

source: A room or space used for assembly purposes that contains seats, tables, displays, equipment or other material shall comply with this section.
fr_ca: Une pièce ou une aire utilisée à des fins de réunions qui contient des sièges, des tables, des présentoirs, de l'équipement ou d'autres matériaux doit être conforme à la présente section.
